Revit 2026 API

# SolidOrShellTessellationControls Methods

---

The SolidOrShellTessellationControls type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DisableLevelOfDetail | Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UseLevelOfDetail | Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |

#### Reference

SolidOrShellTessellationControls Class

Autodesk.Revit.DB Namespace